In [3]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\microsoft\anaconda3\lib\site-packages (0.5.0)
Requirement already satisfied: six in c:\users\microsoft\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: sqlparse in c:\users\microsoft\anaconda3\lib\site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: prettytable in c:\users\microsoft\anaconda3\lib\site-packages (from ipython-sql) (3.7.0)
Requirement already satisfied: ipython-genutils in c:\users\microsoft\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\microsoft\anaconda3\lib\site-packages (from ipython-sql) (2.0.12)
Requirement already satisfied: ipython in c:\users\microsoft\anaconda3\lib\site-packages (from ipython-sql) (7.31.1)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\microsoft\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.3.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\microsoft\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (1.1.1)
Requirement already satisfied: decorator in c:\users\microsoft\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: traitlets>=4.2 in c:\users\microsoft\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: matplotlib-inline in c:\users\microsoft\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: colorama in c:\users\microsoft\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.5)
Requirement already satisfied: jedi>=0.16 in c:\users\microsoft\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: pickleshare in c:\users\microsoft\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: backcall in c:\users\microsoft\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: setuptools>=18.5 in c:\users\microsoft\anaconda3\lib\site-packages (from ipython->ipython-sql) (63.4.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\microsoft\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.20)
Requirement already satisfied: pygments in c:\users\microsoft\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.11.2)
Requirement already satisfied: wcwidth in c:\users\microsoft\anaconda3\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\microsoft\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)

In [4]:
!pip install PyMySQL

Requirement already satisfied: PyMySQL in c:\users\microsoft\anaconda3\lib\site-packages (1.0.3)

In [5]:
import sqlalchemy
import pymysql

pymysql.install_as_MySQLdb()

engine = sqlalchemy.create_engine('mysql+mysqldb://root:sanaz11@covid') # connect to server

In [6]:
%load_ext sql

# Connect to the database
%sql  mysql://root:sanaz11@localhost:3306/classicmodels

In [7]:
%config SqlMagic.displaycon = False

In [8]:
%sql select * from orders limit 5

5 rows affected.

[(10100, datetime.date(2022, 2, 1), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 20),
 (10101, datetime.date(2022, 3, 1), datetime.date(2003, 1, 18), datetime.date(2003, 1, 11), 'Shipped', 'Check on availability.', 128, 20),
 (10102, datetime.date(2022, 2, 1), datetime.date(2003, 1, 18), datetime.date(2003, 1, 14), 'Shipped', None, 181, 20),
 (10103, datetime.date(2022, 3, 8), datetime.date(2003, 2, 7), datetime.date(2003, 2, 2), 'Shipped', None, 121, 20),
 (10104, datetime.date(2003, 1, 31), datetime.date(2003, 2, 9), datetime.date(2003, 2, 1), 'Shipped', None, 141, 20)]

# Create Trigger

In [81]:
%sql DROP TABLE info_order

0 rows affected.

[]

In [82]:
%sql CREATE TABLE info_order(id int PRIMARY KEY auto_increment, date CHAR(50))

0 rows affected.

[]

In [83]:
%sql DROP TRIGGER after_orders_update

0 rows affected.

[]

In [84]:
%%sql 
CREATE TRIGGER after_orders_update
AFTER UPDATE ON orders
FOR EACH ROW
BEGIN
INSERT INTO info_order(date) VALUES(NOW());
END

0 rows affected.

[]

In [85]:
%sql select * from orders WHERE customerNumber=121 limit 2

2 rows affected.

[(10103, datetime.date(2022, 3, 8), datetime.date(2003, 2, 7), datetime.date(2003, 2, 2), 'Shipped', None, 121, 20),
 (10158, datetime.date(2022, 3, 8), datetime.date(2003, 10, 18), datetime.date(2003, 10, 15), 'Shipped', None, 121, 20)]

In [86]:
%sql UPDATE orders SET orderDate='2022-03-08' WHERE customerNumber=121

4 rows affected.

[]

In [87]:
%sql SELECT * FROM info_order

4 rows affected.

[(1, '2023-05-10 15:26:35'),
 (2, '2023-05-10 15:26:35'),
 (3, '2023-05-10 15:26:35'),
 (4, '2023-05-10 15:26:35')]

# Create procedure

In [98]:
%%sql
DROP PROCEDURE insert_column;

ALTER TABLE payments
DROP COLUMN year_past;

0 rows affected.
0 rows affected.

[]

In [99]:
%sql SELECT * FROM payments limit 4

4 rows affected.

[(103, 'HQ336336', datetime.date(2004, 10, 19), Decimal('6066.78')),
 (103, 'JM555205', datetime.date(2003, 6, 5), Decimal('14571.44')),
 (103, 'OM314933', datetime.date(2004, 12, 18), Decimal('1676.14')),
 (112, 'BO864823', datetime.date(2004, 12, 17), Decimal('14191.12'))]

In [100]:
%%sql
CREATE PROCEDURE insert_column()#without input and output
BEGIN
    ALTER TABLE payments
    ADD COLUMN year_past INT;
    
    UPDATE payments SET year_past=YEAR(NOW())-YEAR(paymentDate);
END

0 rows affected.

[]

In [101]:
%%sql

CALL insert_column()

273 rows affected.

[]

In [102]:
%sql SELECT * FROM payments limit 4

4 rows affected.

[(103, 'HQ336336', datetime.date(2004, 10, 19), Decimal('6066.78'), 19),
 (103, 'JM555205', datetime.date(2003, 6, 5), Decimal('14571.44'), 20),
 (103, 'OM314933', datetime.date(2004, 12, 18), Decimal('1676.14'), 19),
 (112, 'BO864823', datetime.date(2004, 12, 17), Decimal('14191.12'), 19)]

In [112]:
%%sql
DROP PROCEDURE testprocedure;


CREATE PROCEDURE testprocedure(In id INTEGER, OUT col INTEGER)
    BEGIN
     SELECT e1.firstName as name, e1.lastName as family, e2.firstName , e2.lastName  
         from employees as e1
            LEFT JOIN employees as e2 
        on e2.employeeNumber = e1.reportsTo
        WHERE e1.employeeNumber = id;
    END

0 rows affected.
0 rows affected.

[]

In [113]:
%sql SET @col=""
%sql CALL testprocedure(1002, @col)

(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '' at line 1")
[SQL: SET @col=]
(Background on this error at: https://sqlalche.me/e/20/f405)
1 rows affected.

[('Diane', 'Murphy', None, None)]

# Create transaction

In [114]:
%%sql 
START TRANSACTION ;
select * from orders;
UPDATE test3 SET number_year=100 where name='ddd';
COMMIT;

0 rows affected.
326 rows affected.
1 rows affected.
0 rows affected.

[]